{
  "bob": {
    "firstName": "Robert",
    "lastName": "Jackson",
    "email": "bobjack@yahoo.com",
    "phone": "(206) 488-1111"
  },
  "cm": {
    "firstName": "Carlos",
    "lastName": "Moreno",
    "suffix": "PhD",
    "phone": "(617) 840-9044",
    "email": "soyelmoreno@gmail.com",
    "addr": "2309 N 193rd St., Shoreline, WA 98133",
    "addrhtml": {
      "sub": "rd",
      "tag": "sup"
    },
    "summary1": "Versatile software engineer with a passion for building effective tools and applications. My 9+ years of industry experience has equipped me with strong technical skills, and skills from my academic background set me apart from other engineers. Seeking a challenging position to learn new technologies and solve complex problems.",
    "summary": "Versatile software engineer with a passion for building effective tools. My 9+ years of industry experience has equipped me with strong technical skills, and skills from my academic background set me apart from others. Seeking a rewarding Front End Engineer position building high performance UIs using modern web technologies.",
    "jobsimple": "Front End Developer",
    "jobs": [
      {
        "company": "Oracle, Inc.",
        "city": "Cambridge, MA",
        "dates": "April 2013 - August 2020",
        "roles": [
          {
            "title": "Front End Developer",
            "tasks1": [
              "Remediated high-performance e-commerce applications built with older technologies to modern JavaScript. Customized Oracle JET components as building blocks for team members to consume.",
              "Lead developer for producing clean, accessible HTML and cutting-edge CSS styling rules and page layouts from wireframes. Served as liaison between Design/UX team and dev teams.",
              "Lead developer for adhering to accessibility guidelines and WAI-ARIA best practices. Proficient with JAWS. Assisted BA and QA teams in writing functional specifications and tests related to accessibility.",
              "Organized SASS/CSS files in codebase. Wrote SASS compilation build scripts, HTML/CSS coding standards, technical documentation. Gave presentations on styling and accessibility.",
              "Implemented systems for supporting bi-directional languages, internationalized strings, browser text zooming, icon fonts, cross-browser compatibility, and modern Flexbox and Grid layouts."
            ],
            "tasks": [
              "Remediated high-performance e-commerce applications built with older technologies to modern JavaScript using the Oracle JET framework.",
              "Created working prototypes and building block components for others to consume.",
              "Lead developer for producing clean, accessible HTML and cutting-edge SASS/CSS styling rules and page layouts (including Flexbox and Grid) from design wireframes.",
              "Lead developer for adhering to accessibility guidelines and WAI-ARIA best practices. Proficient with JAWS.",
              "Wrote SASS build scripts, HTML/CSS coding standards, technical documentation. Gave presentations on styling and accessibility.",
              "Implemented support for RTL languages, browser text zooming, icon fonts, cross-browser compatibility."
            ]
          }
        ]
      },
      {
        "company": "Daedalus Software, Inc.",
        "city": "Cambridge, MA",
        "dates": "March 2011 - March 2013",
        "roles": [
          {
            "title": "Web Developer",
            "tasks": [
              "Fixed bugs and implemented new functionality in UI, business, and database layers of enterprise C#.NET biobanking applications. Including: customized SSRS reports, complex client-side UI behaviors, refactoring database schema to accommodate shifting data relationships."
            ]
          },
          {
            "title": "Technical Support Engineer",
            "tasks": [
              "Provided IT and technical support to clients. Wrote Microsoft SQL scripts for correcting data errors, removing protected health information, and deployment to clients' staging/production servers."
            ]
          },
          {
            "title": "Product Manager",
            "tasks": [
              "Gathered requirements, managed product release scope. Provided demos/training to clients.",
              "Wrote software documentation, functional specifications, test scripts, and traceability matrices."
            ]
          }
        ]
      },
      {
        "company": "Independent Web Developer",
        "city": null,
        "dates": "2002 - present",
        "roles": [
          {
            "title": null,
            "tasks": [
              {
                "enabled": true,
                "linkurl": "http://www.arturandtailors.com",
                "linktext": "ArturAndTailors.com",
                "itemtext": ": Database-driven photo gallery using AJAX for rapid image navigation. Customized content management system allows client to manage photos. HTML, CSS, JavaScript/jQuery, PHP, MySQL"
              },
              {
                "enabled": true,
                "linkurl": "http://www.tangodelosmuertos.com",
                "linktext": "TangoDeLosMuertos.com",
                "itemtext": ": International tango festival. Website, registration system, and on-site materials"
              },
              {
                "enabled": false,
                "linkurl": "http://www.morenotango.com",
                "linktext": "MorenoTango.com",
                "itemtext": ": Website and registration forms for Argentine tango dance instruction and events"
              }
            ]
          }
        ]
      },
      {
        "company": "Harvard University",
        "city": "Cambridge, MA",
        "dates": "Sept 2003 - June 2010",
        "roles": [
          {
            "title": "Graduate Research Assistant",
            "tasks": [
              "Wrote scripts, functions, and user interfaces for processing data and analyzing results.",
              "Research examined locomotion in animals. Published research, presented at major conferences.",
              "Teaching assistant in undergraduate courses. Strong communication, teaching, and organizational skills."
            ]
          }
        ]
      }
    ],
    "skills": {
      "strong": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "Oracle JET",
        "jQuery",
        "KnockoutJS",
        "SASS",
        "LESS",
        "Responsive Design",
        "Git",
        "JAWS",
        "PHP",
        "MySQL",
        "Photoshop",
        "Illustrator"
      ],
      "familiar": [
        "ReactJS",
        "NodeJS",
        "REST",
        "C#",
        ".NET",
        "Microsoft SQL",
        "Java"
      ],
      "other": [
        "Python",
        "Jest",
        "Jasmine",
        "Gulp",
        "Grunt",
        "RequireJS",
        "ES6",
        "AJAX",
        "Bootstrap",
        "SVN",
        "Bash",
        "Wordpress",
        "C/C++",
        "SSRS",
        "MATLAB",
        "LabVIEW",
        "VBA",
        "Assembly"
      ]
    },
    "education": [
      {
        "id": 1,
        "school": "Harvard University",
        "location": "Cambridge, MA",
        "graduation": "May 2010",
        "description": "Ph.D., Organismic and Evolutionary Biology"
      },
      {
        "id": 2,
        "school": "University of Washington",
        "location": "Seattle, WA",
        "graduation": "June 2001",
        "description": "B.S. Zoology. Minor: Music"
      }
    ]
  },

  "superuser": {
    "firstName": "Superman",
    "lastName": "Gonzalez",
    "suffix": "Deleon",
    "phone": "(253) 566-2222",
    "email": "superman@gmail.com",
    "addr": "1234 NE 145th St, Krypton, 98011",
    "summary": "I don't need a job because I am all powerful and I can do tons of cool stuff. For that matter, I can pay my bills with my laser eyes. Also, I can fly around and save people and stuff."
  }
}
